app/controllers/posts_controller.rb

	def update

		@post = Post.find(params[:id])

		if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Me and you&"], ["updated_at", "2020-11-06 05:13:21.590485"], ["id", 1]]